Revit 2027 API
Mullion.Lock Property
Get - to get whether the Mullion line is locked. Set - Lock/unlock the Mullion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Lock { get; set; }
Public Property Lock As Boolean
	Get
	Set
public:
property bool Lock {
	bool get ();
	void set (bool value);
}
member Lock : bool with get, set
Property Value
Boolean
See Also
Reference
Mullion Class
Autodesk.Revit.DB Namespace